using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ZamanovTaskOne
{
    class task
    {
        //////////////////////////////////////////////////////////////////////Part 1////////////////////////////////////////////////////////////////////////////////

        //Разработайте класс, который должен содержать:
        //▪элементы разного уровня доступа
        //▪не менее 5 свойств;    
        //▪не менее 4 методов;
        //▪хотя бы одну перегрузку метода; 
        //▪статический метод; 
        //▪константное или поле только для чтения; 
        //▪не менее 3 конструкторов; 
        //▪финализатор.
        //В Main-е создайте объекты вашего класса и продемонстрируйте работоспособность конструкторов и методов

        //Предметная область
        //Класс – вертолет(допустим, в симуляторе для обучения пилотов). 
        //Примеры свойств: модель, грузоподъемность, мощность двигателя.
        //Примеры методов: Заправиться, Полететь в точку A, Отправиться на посадку

        //////////////////////////////////////////////////////////////////////Part 2////////////////////////////////////////////////////////////////////////////////

        //    Модифицируйте программу из предыдущего задания, построив на его основе иерархию(через наследование), как минимум из 5 классов.
        //    Корневой класс иерархии должен быть абстрактным, а хотя бы один класс из потомков –бесплодным.
        //    У каждого из классов должно быть хотя бы одно собственное свойство и метод.
        //    Также должны быть продемонстрированы виртуальные и переопределённые методы.

        //    Примеры классов: вертолёт, Ми-6, самолёт, летательный аппарат, бомбардировщик, боевой вертолёт.
    }
}
